Merge pull request #14 from ramesh-pegasys/feature-add-deployments-readme
Add deployment guides
